RailsFirstProject/app/controllers/users_controller.rb

    def update
      user = User.find(params[:id])


      if user.update(params.require(:user).permit(:name, :email))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "udated"], ["email", "updated@gmail.com"], ["updated_at", "2019-08-26 22:57:27.283984"], ["id", 9]]